app/app/Repositories/ThreadRepository.php

select * from `threads` order by `latest_comment_time` desc limit 3 offset 0
select count(*) as aggregate from `threads`
---
  public function getPaginatedThreads(int $per_page)
  {
    return $this->thread->orderBy('latest_comment_time', 'desc')->paginate($per_page);